tap "buo/cask-upgrade"
tap "mas-cli/tap"
tap "github/gh"
tap "git-friendly/git-friendly"
tap "homebrew/bundle"
tap "homebrew/services"
tap "macos-fuse-t/cask"
tap "oven-sh/bun"

cask_args appdir: "/Applications"

brew "zsh"
brew "starship"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "coreutils"
brew "findutils"
brew "autoconf"
brew "pkg-config"
brew "mackup"
brew "mas"
brew "gnupg"

brew "fnm"
brew "deno"
brew "openjdk"
brew "oven-sh/bun/bun"

brew "bat", args: ["build-from-source"]
brew "micro"
brew "cloc"
brew "wget"
brew "curl"
brew "dog"
brew "eza"
brew "fd"
brew "fzf"
brew "p7zip"
brew "pwgen"
brew "ripgrep"
brew "tree"
brew "ncdu"
brew "httpie"
brew "gotop"
brew "grex"
brew "htop"
brew "mactop"
brew "midnight-commander"
brew "lego"
brew "vips"

brew "gh"
brew "gist"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-flow"
brew "git-fresh"
brew "git-recent"
brew "git-when-merged"
brew "git-friendly/git-friendly/git-friendly"

cask "java" unless system "/usr/libexec/java_home --failfast"
cask "osxfuse"
cask "chromedriver"
cask "ilya-birman-typography-layout"

cask "google-chrome"
cask "firefox"
cask "dropbox"
cask "microsoft-teams"
cask "sequel-ace"
cask "zoom"
cask "iterm2"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "sublime-text"
cask "telegram"
cask "figma"

cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-powerline-symbols"

cask "avifquicklook"
cask "qlcolorcode"
cask "qlcommonmark"
cask "qlmobi"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "qlzipinfo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

mas "Apple Configurator", id: 1037126344
mas "Disk Speed Test", id: 425264550
mas "Fantastical", id: 975937182
mas "Flighty", id: 1358823008
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Remote Desktop", id: 409907375
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Trello", id: 1278508951
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835

vscode "1000ch.svgo"
vscode "aaron-bond.better-comments"
vscode "aarondill.vercel-project-manager-vscode"
vscode "achil.vscode-javascript-repl"
vscode "alecclarkedev.to-typescript"
vscode "aliariff.auto-add-brackets"
vscode "astro-build.astro-vscode"
vscode "atlassian.atlascode"
vscode "be5invis.toml"
vscode "bierner.lit-html"
vscode "biomejs.biome"
vscode "blanu.vscode-styled-jsx"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bruceyuhb.hsl-preview"
vscode "ccy.ayu-adaptive"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "codezombiech.gitignore"
vscode "crystal-spider.jsdoc-generator"
vscode "cs50.vscode-presentation-mode"
vscode "csstools.postcss"
vscode "ctcuff.font-preview"
vscode "cucumberopen.cucumber-official"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gregorbiswanger.json2ts"
vscode "gruntfuggly.align-mode"
vscode "hbenl.vscode-test-explorer"
vscode "huuums.vscode-fast-folder-structure"
vscode "jakewilson.vscode-placeholder-images"
vscode "janisdd.vscode-edit-csv"
vscode "jasonnutter.vscode-codeowners"
vscode "jduponchelle.jira-link"
vscode "jock.svg"
vscode "kavish.hex-to-hsl"
vscode "kevinkyang.auto-comment-blocks"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kristiyanvelkov.next-cli-turbo"
vscode "lafe.contextualduplicate"
vscode "lior-chamla.google-fonts"
vscode "ludviglundgren.stockholmtheme"
vscode "mattpocock.ts-error-translator"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-lebab"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "mscolnick.vscode-type-only-imports"
vscode "mylesmurphy.prettify-ts"
vscode "naumovs.color-highlight"
vscode "orta.vscode-jest"
vscode "orta.vscode-twoslash-queries"
vscode "paulmolluzzo.convert-css-in-js"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pflannery.vscode-versionlens"
vscode "phoenisx.cssvar"
vscode "pmneo.tsimporter"
vscode "pomber.git-file-history"
vscode "rangav.vscode-thunder-client"
vscode "rcore.rcore-unused-css-classes"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rusnasonov.vscode-typograf"
vscode "sachinb94.css-tree"
vscode "shaharkazaz.git-merger"
vscode "shailen.netlify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sourcegraph.cody-ai"
vscode "spmeesseman.vscode-taskexplorer"
vscode "srmeyers.git-prefix"
vscode "steoates.autoimport"
vscode "stivo.tailwind-fold"
vscode "stringham.move-ts"
vscode "sudoaugustin.tailpile"
vscode "thenouillet.symfony-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "vercel.turbo-vsc"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "vue.volar"
vscode "vunguyentuan.vscode-postcss"
vscode "webben.browserslist"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "xdebug.php-debug"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
vscode "znck.grammarly"
