tap "buo/cask-upgrade"
tap "mas-cli/tap"
tap "github/gh"
tap "git-friendly/git-friendly"
tap "macos-fuse-t/cask"
tap "oven-sh/bun"

cask_args appdir: "/Applications"

# Zsh Essentials
brew "zsh"
brew "starship"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# System tools
brew "coreutils", link: false
brew "findutils", link: false
brew "uutils-coreutils"
brew "uutils-findutils"
brew "autoconf"
brew "pkg-config"
brew "mackup"
brew "mas"
brew "gnupg"
cask "osxfuse"
cask "ilya-birman-typography-layout"

# Utils
brew "bat", args: ["build-from-source"]
brew "micro"
brew "cloc"
brew "pwgen"
brew "vips"

# Compression tools
brew "ouch"
brew "p7zip"

# Filesystem tools
brew "fd"
brew "fzf"
brew "tree"
brew "grex"
brew "ripgrep"
brew "eza"

# Network tools
brew "wget"
brew "curl"
brew "hurl"
brew "httpie"
brew "dog"

# Git
brew "gh"
brew "gist"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-flow"
brew "git-fresh"
brew "git-recent"
brew "git-when-merged"
brew "git-friendly/git-friendly/git-friendly"

# Node.js
brew "fnm"
brew "deno"
brew "oven-sh/bun/bun"

# Java
cask "java" unless system "/usr/libexec/java_home --failfast"

# Python
brew "python@3.12"
brew "uv"

# Rust
brew "rust"

# GUI tools
brew "lazygit"
brew "lazysql"
brew "lazyssh"
brew "htop"
brew "mactop"
brew "gotop"
brew "midnight-commander"
brew "ncdu"

# AI tools
brew "codex"

# Applications
cask "container"
cask "google-chrome"
cask "firefox"
cask "zoom"
cask "iterm2"
cask "visual-studio-code"
cask "telegram"
cask "figma"
cask "zed"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-powerline-symbols"

# Apps Store
mas "Fantastical", id: 975937182
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
