tap "buo/cask-upgrade"
tap "mas-cli/tap"
tap "github/gh"
tap "git-friendly/git-friendly"
tap "homebrew/bundle"
tap "homebrew/services"
tap "macos-fuse-t/cask"
tap "oven-sh/bun"

cask_args appdir: "/Applications"

brew "zsh"
brew "starship"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "coreutils"
brew "findutils"
brew "autoconf"
brew "pkg-config"
brew "mackup"
brew "mas"
brew "gnupg"

brew "fnm"
brew "deno"
brew "openjdk"
brew "oven-sh/bun/bun"

brew "bat", args: ["build-from-source"]
brew "micro"
brew "cloc"
brew "wget"
brew "curl"
brew "dog"
brew "eza"
brew "fd"
brew "fzf"
brew "p7zip"
brew "pwgen"
brew "ripgrep"
brew "tree"
brew "ncdu"
brew "httpie"
brew "gotop"
brew "grex"
brew "htop"
brew "mactop"
brew "midnight-commander"
brew "lego"
brew "vips"

brew "gh"
brew "gist"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-flow"
brew "git-fresh"
brew "git-recent"
brew "git-when-merged"
brew "git-friendly/git-friendly/git-friendly"

cask "java" unless system "/usr/libexec/java_home --failfast"
cask "osxfuse"
cask "chromedriver"
cask "ilya-birman-typography-layout"

cask "google-chrome"
cask "firefox"
cask "dropbox"
cask "microsoft-teams"
cask "sequel-ace"
cask "zoom"
cask "iterm2"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "telegram"
cask "figma"
cask "zed"

cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-powerline-symbols"

cask "avifquicklook"
cask "qlcolorcode"
cask "qlcommonmark"
cask "qlmobi"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "qlzipinfo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

mas "Apple Configurator", id: 1037126344
mas "Disk Speed Test", id: 425264550
mas "Fantastical", id: 975937182
mas "Flighty", id: 1358823008
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Remote Desktop", id: 409907375
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Trello", id: 1278508951
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
